{
  "en": {
    "high": "The neural network indicates a high probability of skin cancer based on the mole. We highly recommend seeking immediate medical attention and consulting with a dermatologist for further evaluation. Early detection and treatment can significantly improve the chances of successful recovery.",
    "medium": "The neural network suggests a moderate probability of skin cancer based on the mole. While it is not conclusive, it is advisable to schedule an appointment with a dermatologist for a professional examination. They will be able to provide a more accurate diagnosis and guide you on the next steps.",
    "low": "The neural network indicates a low probability of skin cancer based on the mole. However, it is still important to practice regular skin monitoring and take precautions. If you notice any changes or have concerns in the future, don't hesitate to consult with a dermatologist for further evaluation.",
    "warning": "MoleSpector is intended for initial skin mole assessment only and should not replace professional medical opinion. Please note that this app does not provide a diagnosis. Any concerns should be discussed with a licensed healthcare provider. Always seek medical advice if your skin mole changes in size, shape, color, or texture. Early detection of skin cancer is critical for effective treatment."
  },
  "rus": {
    "high": "Нейронная сеть указывает на высокую вероятность наличия рака кожи по данной родинке. Мы настоятельно рекомендуем незамедлительно обратиться за медицинской помощью и проконсультироваться с дерматологом для дальнейшей оценки. Раннее выявление и лечение могут значительно повысить шансы на успешное выздоровление.",
    "medium": "Нейронная сеть предполагает умеренную вероятность наличия рака кожи по данной родинке. Хотя результат не является окончательным, рекомендуется запланировать прием к дерматологу для профессионального осмотра. Он сможет провести более точную диагностику и руководить вас в дальнейших действиях.",
    "low": "Нейронная сеть указывает на низкую вероятность наличия рака кожи по данной родинке. Однако все же важно регулярно следить за состоянием кожи и принимать меры предосторожности. Если вы заметите какие-либо изменения или возникнут вопросы в будущем, не стесняйтесь обратиться к дерматологу для дальнейшей оценки.",
    "warning": "MoleSpector предназначен только для начальной оценки родинок на коже и не должен заменять профессиональное медицинское мнение. Пожалуйста, обратите внимание, что это приложение не предоставляет диагноз. Любые опасения следует обсудить с лицензированным медицинским специалистом. Всегда обращайтесь за медицинской консультацией, если ваша родинка меняет размер, форму, цвет или текстуру. Раннее выявление рака кожи крайне важно для эффективного лечения."
  }
}
